---
kind: property
id: P:Autodesk.Revit.DB.FamilyThermalProperties.HeatTransferCoefficient
source: html/90d75bb8-07ce-eee9-0995-838c2f1576f1.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.HeatTransferCoefficient Property

The heat transfer coefficient value (U-Value).
 The units are watts per meter-squared kelvin (W/(m^2*K)).

## Syntax (C#)
```csharp
public double HeatTransferCoefficient { get; }
```